Autodesk.Revit.UI.TaskDialogIcon
Standard icons to be used in the task dialog.
Since: 2011

Autodesk.Revit.UI.TaskDialogIcon.TaskDialogIconShield
Shield icon.
Since: 2018

Autodesk.Revit.UI.TaskDialogIcon.TaskDialogIconInformation
Information icon.
Since: 2018

Autodesk.Revit.UI.TaskDialogIcon.TaskDialogIconError
Error icon.
Since: 2018

Autodesk.Revit.UI.TaskDialogIcon.TaskDialogIconWarning
Warning icon.

Autodesk.Revit.UI.TaskDialogIcon.TaskDialogIconNone
No icon.